run/conjugateBatteryCC_statics/0/inducedVoltage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      inducedVoltage;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    liquidToSteelInterface
    {
        type            fixedValue;
	value           $internalField;
    }
    liquidToLithiumInterface
    {
        type            fixedValue;
	value           $internalField;
    }
    topSurface
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
