run/conjugateBatteryCC_statics/0/solid/solidInducedVoltage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      solidInducedVoltage;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    steelInterface
    {
        type            regionCoupling;
        remoteField     inducedVoltage;
        value           uniform 0;
    }
    lithiumInterface
    {
        type            regionCoupling;
        remoteField     inducedVoltage;
        value           uniform 0;
    }
    outsideSurface
    {
        type            zeroGradient;
    }
    topSurface
    {
	type            zeroGradient;
    }
    topLithium
    {
	type            zeroGradient;
    }
    topAttachmentPoint
    {
	type            fixedValue;
	value           uniform 0;
    }
    outerAttachmentPoint
    {
	type            fixedValue;
	value           uniform 0;
    }

}

// ************************************************************************* //
